// В этом файле содержится исходный код программы на C++.

// Функция main - это входная точка программы.

/*
 * Соответствия в другим языка программирования:
 * - Python: if __name__ == '__main__' ...
 * - Java: public static void main(String[] args) ...
 */

 #include <iostream>
 int main(int argc, char **argv) {
  // std::cout << ЭЭ << '\n';
  return 7;
  }


/*
 * Задания:
 * 1. Запустите программу. Что она выводит?
 * A: Program finished with exit code 0
 * 2. Внесите изменения в возвращаемое значение функции. Что теперь выводит программа?
 * A: Если в return поставить другое число, то будет такой вывод: ...Program finished with exit code "Число"
 * 3. Что будет, если убрать из файла функцию main? Запустится ли она?
 * A: Нет, не запустится, выведется ошибка
 */
